# Install Cask (Homebrew extension)
tap 'homebrew/cask'

# Install Git
brew 'git'

# Install CLI Apps
brew 'ripgrep'
brew 'htop'
brew 'bash'
brew 'bash-completion@2'
brew 'fzf'
brew 'git-extras'
brew 'neovim'
brew 'tree'
brew 'jq'
brew 'wget'
brew 'nvm'
brew 'shellcheck'

# Install Apps
cask 'devutils'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'sublime-text'
cask 'vlc'
cask 'keka'
cask 'rectangle'
cask 'spotify'
cask 'charles'
cask 'wireshark'
cask 'microsoft-edge'
cask 'karabiner-elements'
cask 'speedcrunch'
cask 'grandperspective'
cask 'zoom'
cask 'browserstacklocal'
cask 'hex-fiend'
cask 'vscodium'
cask 'mouse-fix'
cask 'postman'

# install from app store
mas "Xcode", id: 497799835
